---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipePlumbingFixtureFlowService
source: html/b6d5fbde-e368-ff55-b370-fff3db1f7cde.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipePlumbingFixtureFlowService Property

The external service which permits registration of an alternate implementation for pipe fixture flow calculation.
 To use this service, programmers implement a server class that derives from IPipePlumbingFixtureFlowServer .

## Syntax (C#)
```csharp
public static ExternalServiceId PipePlumbingFixtureFlowService { get; }
```